/*Начало работы. В начале можно сразу прописать просто class и выбрать предлогаемый
 вариант, и сразу пропишеться public class Lesson_01_00, где название Lesson_01_00 автоматом берёться
 из названия самого созданного файла в котором мы работаем. Далее прописываем main 
 и в отобразившемся списке его выбираем, получаем public static void main(String[] args)
 в котором мы уже дальше можем работать с кодом.
 Также, стоить заметить такой факт, файл в котором работаем, как подписан, так и должен
 быть подписан class. Не будет рабать программа, если файл с одним наименованием, а класс
 с другим наименованием.
 */
public class Lesson_01_00 {

    public static void main(String[] args) {
        System.out.println("Vivod"); 
    }
}
/*Чтобы вывести в терминал небходимые нам данные(любые) прописываем 
sys далее в выпадающем списке нам даёт выбрать сразу надпись sysout - мы её вибираем
и прописываеться строчка автоматом - System.out.println(); где уже с кобочках
мы можем прописывать то что хотим отобразить в консоле(терминале) к примеру
System.out.println("Vivod");*/
