/*Классы-обёртки.*/
public class Lesson_01_04 {
    public static void main(String[] args) {
        int a = 123;
        System.out.println(a);
        System.out.println("Максимальный размер");
        System.out.println(Integer.MAX_VALUE);
        System.out.println("Минимальный размер");
        System.out.println(Integer.MIN_VALUE);
    }
}
/*Класс-обёртки очень нужен и полезен.
Если взять на примере типа данных int, чтобы вызвать для него клас обёртки необходимо
прописать Integer далее точка и выбрать что мы хотим. В выпадающем списка тьма операций
которые мы можем сделать, и узнать максимальный размера типа данных с которым мы работаем,
что в данном примере мы и сделали. Мы можем сделать преобразование в другеи типы данных и 
наоборот, кароче почва для изучения и работы много. Названия всех обёрток для нужного
типа данных я положу в доп материалы картинку, так как для каждого типа данных
есть строгое прописывание название обёртки чтобы её вызвать.*/